In [2]:
import sqlite3
import pandas as pd

# Path to your database
db_path = r"C:\Users\Trevor\Documents\dumps\chinook.db"

# Connect to the SQLite database
conn = sqlite3.connect(db_path)

# Show all tables
tables = pd.read_sql_query(
    "SELECT name FROM sqlite_master WHERE type='table';",
    conn
)
print("Tables in the database:")
print(tables)

# # Example: load a table (replace Albums with any table name you see)
# df = pd.read_sql_query("SELECT * FROM Albums LIMIT 5;", conn)
# df

Tables in the database:
               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [4]:
pd.read_sql_query("SELECT FirstName FROM customers LIMIT 10;", conn)

   FirstName
0       Luís
1     Leonie
2   François
3      Bjørn
4  František
5     Helena
6     Astrid
7       Daan
8       Kara
9    Eduardo

C:\Users\Trevor\AppData\Local\Temp\ipykernel_24608\3669298304.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employee LIMIT 10;", conn)